15331122 黄依婷 Hw1

##1、简单题
#软件工程的定义：
是指导计算机软件开发和维护的工程学科。采用工程的概念、原理、技术和方法来开发与维护软件，
把经过实践考验而证明正确的管理技术和当前能够得到的最好的技术方法结合起来，这就是软件工程。

#阅读经典名著“人月神话”等资料，解释 software crisis、COCOMO 模型。
software crisis：早期用来表示在需求时间难以写出高效有用的计算机程序。
造成原因主要是快速增长的计算机功能和问题的复杂程度。
开发大型的软件，成本更是呈指数型增长，进度严重延后。

COCOMO模型：在软件项中估算工作量、成本以及时间表的模型。COCOMO模型由三个不断深入和详细的层次组成。
COCOMP模型发现团队质量目前是最大的决定因素，实际上是下一个次重要因素的4倍。


#软件生命周期：（4个时期7个阶段）
 1）软件分析时期：问题定义、可行性研究、需求分析
 2）软件设计时期：总体设计、详细设计
 3）编码与测试时期：编码、测试
 4）运行与维护时期

#按照 SWEBok 的 KA 划分，本课程关注哪些 KA 或 知识领域？
 SWEBOK指南将软件工程知识体系划分为10个知识域（Knowledge Area，KA),分为两类过程。
 一类是开发与维护过程，包括软件需求、软件设计、软件构造、软件测试和软件维护；
 一类是支持和组织过程，包括软件配置管理、软件工程管理、软件工程过程、软件工程工具与方法、软件质量。
 
 10个知识域与其知识域相对应的子知识域： 
  1.软件需求：软件需求基础、软件过程、需求获取、需求分析、需求规格说明、需求确认、时间考虑。
  2.软件设计：软件设计基础、软件设计关键问题、软件结构与体系结构、软件设计质量的分析与评价、软件设计记法、软件设计的策略与方法。
  3.软件构造：软件构造基础、管理构造、实际考虑。
  4.软件测试：软件测试基础、测试级别、测试技术、与测试相关的度量、测试过程。
  5.软件维护：软件维护基础、软件维护关键问题、维护过程、维护技术。
  6.软件配置管理：软件配置过程管理、软件配置标识、软件配置控制、软件配置状态报告、软件配置审计、软件发行管理和交付。
  7.软件工程管理：项目启动和范围定义、软件项目计划、软件项目实施、评审与评价、项目收尾、软件工程度量。
  8.软件工程过程：过程定义、过程实施与变更、过程评估、过程和产品度量。
  9.软件工程工具和方法：软件工具（软件需求工具、软件设计工具、软件构造工具、软件测试工具、软件维护工工具、软件配置管理工具、软件质量工具和其他工具问题）
    软件工程方法（启发式方法、形式化方法、原型方法）。
  10.软件质量：软件质量基础、软件质量过程、时间考虑。
  
  本课程关注：
  软件需求、软件设计、软件构造、软件工程工具和方法。

#解释 CMMI 的五个级别。例如：Level 1 - Initial：无序，自发生产模式。
    (1)初始级(initial)。
    工作无序，项目进行过程中常放弃当初的计划。
    管理无章法，缺乏健全的管理制度。开发项目成效不稳定，项目成功主要依靠项目负责人的经验和能力，他一但离去，工作秩序面目全非。

    (2)可重复级(Repeatable)。
    管理制度化，建立了基本的管理制度和规程，管理工作有章可循。 
    初步实现标准化，开发工作比较好地按标准实施。 
    变更依法进行，做到基线化，稳定可跟踪，新项目的计划和管理基于过去的实践经验，具有重复以前成功项目的环境和条件。

    (3)已定义级(Defined)。
    开发过程，包括技术工作和管理工作，均已实现标准化、文档化。
    建立了完善的培训制度和专家评审制度，全部技术活动和管理活动均可控制，对项目进行中的过程、岗位和职责均有共同的理解。

    (4)已管理级(Managed)。
    产品和过程已建立了定量的质量目标。
    开发活动中的生产率和质量是可量度的。
    已建立过程数据库。
    已实现项目产品和过程的控制。
    可预测过程和产品质量趋势，如预测偏差，实现及时纠正。

    (5)优化级(Optimizing)。
    可集中精力改进过程，采用新技术、新方法。
    拥有防止出现缺陷、识别薄弱环节以及加以改进的手段。
    可取得过程有效性的统计数据，并可据进行分析，从而得出最佳方法 

#用自己语言简述 SWEBok 或 CMMI （约200字）
SEWEBok（软件工程知识域）是IEEE的官方服务标记，是一个国际标准。
它定义了软件工程、被认可的职业、职业特征。它有四个目标，第一个是促进世界范围对软件工程的观点一致，第二个是组织10个KA，
第三个是刻画软件工程的内容，第四个是提供按主题使用知识。

10个KA： [软件需求](https://en.wikipedia.org/wiki/Software_requirements)
         [软件设计](https://en.wikipedia.org/wiki/Software_design)
         [软件构造](https://en.wikipedia.org/wiki/Software_construction)
         [软件工程](https://en.wikipedia.org/wiki/Software_engineering)模型与方法
         


##2、解释 PSP 各项指标及技能要求：
#阅读《现代软件工程》的 PSP: Personal Software Process 章节。 http://www.cnblogs.com/xinz/archive/2011/11/27/2265425.html
#按表格 PSP 2.1， 了解一个软件工程师在接到一个任务之后要做什么，需要哪些技能，解释你打算如何统计每项数据？
#（期末考核，每人按开发阶段提交这个表）

表格PSP 2.1:
Planning                          计划
·         Estimate                ·         估计这个任务需要多少时间
Development                       开发
·         Analysis                ·         分析需求
·         Design Spec             ·         生成设计文档
·         Design Review           ·         设计复审 (和同事审核设计文档)
·         Coding Standard         ·         代码规范 (为目前的开发制定合适的规范)
·         Design                  ·         具体设计
·         Coding                  ·         具体编码
·         Code Review             ·         代码复审
·         Test                    ·         测试（包括自我测试，修改代码，提交修改）
 
 
Record Time Spent                 记录时间花费
Test Report                       测试报告
Size Measurement                  计算工作量
Postmortem                        事后总结
Process Improvement Plan          提出过程改进计划

要比较准确的统计每项数据，例如记录时间的花费。
需要一个比较准确的数据，例如每一个写代码的时间段的开始时间以及连续时间，注意不要计算上吃饭、休息等时间。
如果是过程的改进计划。
则需要一个比较详细的报道，例如提出改进计划的时间，计划的具体内容，计划的实施时间，
计划的成效，计划的实现与假设的差距，考虑原因，考虑下一步计划等。
